#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
--Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_role.gh_actions_s3_role will be created
  + resource "aws_iam_role" "gh_actions_s3_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (sensitive)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = [
          + "arn:aws:iam::aws:policy/AmazonS3FullAccess",
        ]
      + max_session_duration  = 3600
      + name                  = "GithubActionsSMMEFrontendBucketsRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "BusinessService" = "foo"
          + "Confidentiality" = (sensitive)
          + "Environment"     = "foo"
          + "ManagedBy"       = (sensitive)
          + "Name"            = "SMME Github Actions IAM Creator Role"
          + "Project"         = "SMME Merchant Portal"
          + "SecurityZone"    = (sensitive)
          + "TaggingVersion"  = "v2.0"
        }
      + tags_all              = {
          + "BusinessService" = "foo"
          + "Confidentiality" = "foo"
          + "Environment"     = "foo"
          + "ManagedBy"       = "foo"
          + "Name"            = "SMME Github Actions IAM Creator Role"
          + "Project"         = "SMME Merchant Portal"
          + "SecurityZone"    = "foo"
          + "TaggingVersion"  = "v2.0"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy.smme-s3-state-bucket-access will be created
  + resource "aws_iam_role_policy" "smme-s3-state-bucket-access" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = (sensitive)
      + role   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + role_arn = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
--
```

</details>

*Pushed by: @FabioSVBBD, Action: `pull_request`*